AI/event-management-load-test.yml
# Artillery Load Test for Event Management System - OPTIMIZED
# Enhanced to trigger proper HPA scaling with better resource utilization

config:
  target: 'https://hamzakalech.com'
  phases:
    # Phase 1: Medium Load - Aggressive scaling trigger
    - duration: 1800  # 30 minutes
      arrivalRate: 45  # Increased from 27 to ensure scaling
      rampTo: 55      # Ramp up to create sustained pressure
      name: "🟡 Medium Load - Aggressive Scaling (35-40 RPS)"
    
    # Phase 2: Light Load - Scale down validation  
    - duration: 1200  # 20 minutes
      arrivalRate: 15   # Slightly higher to maintain some load
      name: "🟢 Light Load - Scale Down Test (8 RPS)"
    
    # Phase 3: Heavy Load - Maximum scaling trigger
    - duration: 1500   # 25 minutes
      arrivalRate: 90  # Higher initial load
      rampTo: 110     # Ramp to maximum load
      name: "🔴 Heavy Load - Maximum Scaling (80-100 RPS)"
    
    # Phase 4: Medium Load - Stabilization
    - duration: 1800  # 30 minutes
      arrivalRate: 40  
      rampTo: 45
      name: "🟡 Medium Load - Stabilization (35-40 RPS)"
    
    # Phase 5: Light Load - Final scale down
    - duration: 900   # 15 minutes
      arrivalRate: 15
      name: "🟢 Light Load - Final Cleanup (8 RPS)"

  # Optimized HTTP settings for better resource utilization
  http:
    pool: 50        # Reduced to create more connection pressure
    timeout: 30     # Shorter timeout to fail faster and retry
    keepAlive: false # Force new connections for more CPU load
    
  tls:
    rejectUnauthorized: false

  processor: "./event-load-functions.js"

  # Add proper metrics collection
  plugins:
    ensure:
      p99: 5000  # Ensure 99% of requests complete within 5s
      maxErrorRate: 5  # Allow up to 5% error rate during scaling
    
  # Environment variables for better load distribution
  variables:
    scalingTargets:
      - "5-8"     # Increased expected pods for medium load
      - "1-3"     # Light load
      - "12-20"   # Increased for heavy load
      - "5-8"     # Medium load stabilization  
      - "1-3"     # Final cleanup

scenarios:
  # Scenario 1: CPU-Intensive Frontend Operations (30% of traffic)
  - name: "CPU Intensive Frontend"
    weight: 30
    flow:
      - function: "initializeTest"
      - function: "logPhaseInfo"
      
      # Multiple rapid requests to increase CPU load
      - loop:
          - get:
              url: "/"
              headers:
                User-Agent: "LoadTest-CPU-{{ $randomInt(1000, 9999) }}"
                Cache-Control: "no-cache, no-store, must-revalidate"
                Pragma: "no-cache"
          - think: 0.1
          - get:
              url: "/events"
              headers:
                Cache-Control: "no-cache"
          - think: 0.1
        count: "{{ $randomInt(3, 6) }}"
      
      # CPU stress operations
      - function: "cpuStressTest"
      
      # Concurrent asset loading to increase memory pressure
      - parallel:
          - get:
              url: "/main.js"
          - get:
              url: "/styles.css"
          - get:
              url: "/polyfills.js"
          - get:
              url: "/runtime.js"

  # Scenario 2: High-Pressure API Operations (50% of traffic)
  - name: "High Pressure API"
    weight: 50
    flow:
      - function: "initializeTest"
      
      # Rapid health checks to warm up
      - loop:
          - get:
              url: "/api/actuator/health"
              headers:
                Accept: "application/json"
                Cache-Control: "no-cache"
          - think: 0.05
        count: 3
      
      # Intensive event operations
      - get:
          url: "/api/events?size=50"  # Larger page size
          headers:
            Accept: "application/json"
            X-Load-Test: "high-pressure"
      
      # Multiple concurrent event creations
      - function: "generateEventData"
      - parallel:
          - post:
              url: "/api/events"
              headers:
                Content-Type: "application/json"
              json:
                description: "{{ eventDescription }}-Parallel-1"
                date: "{{ eventDate }}"
                Number_of_tickets: "{{ ticketNumber }}"
                additional_notes: "{{ additionalNotes }}"
                place: "{{ eventPlace }}"
          - post:
              url: "/api/events"
              headers:
                Content-Type: "application/json"
              json:
                description: "{{ eventDescription }}-Parallel-2"
                date: "{{ eventDate }}"
                Number_of_tickets: "{{ $randomInt(100, 500) }}"
                additional_notes: "Parallel creation stress test"
                place: "{{ eventPlace }}"
      
      # Database stress with large queries
      - loop:
          - get:
              url: "/api/events?page={{ $randomInt(0, 10) }}&size=100"
              headers:
                Accept: "application/json"
                X-Database-Stress: "true"
          - think: 0.2
          - function: "memoryStressTest"
        count: "{{ $randomInt(2, 5) }}"

  # Scenario 3: Memory and Database Intensive (20% of traffic)
  - name: "Memory Database Stress"
    weight: 20
    flow:
      - function: "memoryStressTest"
      - function: "cpuStressTest"
      
      # Large bulk operations
      - function: "generateBulkEventData"
      - loop:
          - post:
              url: "/api/events"
              headers:
                Content-Type: "application/json"
                X-Bulk-Memory-Test: "{{ $loopCount }}"
              json:
                description: "{{ bulkEventDescription }}-Memory-{{ $loopCount }}"
                date: "{{ bulkEventDate }}"
                Number_of_tickets: "{{ $randomInt(500, 1000) }}"  # Larger numbers
                additional_notes: "Memory stress test with large ticket count and extended description data that will consume more memory during processing and JSON serialization operations"
                place: "{{ bulkEventPlace }} - Extended location data"
          - function: "cpuStressTest"
          - think: 0.3
        count: "{{ $randomInt(4, 8) }}"
      
      # Concurrent large queries
      - parallel:
          - get:
              url: "/api/events?size=200"
          - get:
              url: "/api/events?page=0&size=150"
          - get:
              url: "/api/events?page=1&size=150"
      
      # Additional memory pressure
      - function: "memoryStressTest"